In [2]:
import pandas as pd
import seaborn as sns

In [3]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [4]:
# let implement group by function
# survival count by gender
df.groupby('sex')['survived'].count()
# this give how many women and men were on board

sex
female    314
male      577
Name: survived, dtype: int64

In [6]:
import warnings
warnings.filterwarnings('ignore')

In [7]:
# grouping by pclass
df.groupby('class')['survived'].count()

class
First     216
Second    184
Third     491
Name: survived, dtype: int64

In [8]:
# similary find out passenger embarked from town
df.groupby('embark_town')['survived'].count()

embark_town
Cherbourg      168
Queenstown      77
Southampton    644
Name: survived, dtype: int64

In [9]:
df['fare'].min()

np.float64(0.0)

In [10]:
df['age'].max()

np.float64(80.0)

In [11]:
df['age'].min()

np.float64(0.42)

In [13]:
df['age'].mean()

np.float64(29.69911764705882)

In [ ]:
# age analysis using .agg()

In [16]:
df.groupby(['sex'])['age'].agg(['mean','min','max'])

             mean   min   max
sex
female  27.915709  0.75  63.0
male    30.726645  0.42  80.0

In [17]:
# find fare for every passenger class
df.groupby(['class'])['fare'].agg(['mean','min','max'])

             mean  min       max
class
First   84.154687  0.0  512.3292
Second  20.662183  0.0   73.5000
Third   13.675550  0.0   69.5500

In [19]:
# how many male and female died and survivaed
df.groupby('sex')['survived'].value_counts()

sex     survived
female  1           233
        0            81
male    0           468
        1           109
Name: count, dtype: int64

In [22]:
df.groupby('sex').agg(
    total_passengers=('survived','count'),
    avg_age = ('age','mean'),
    survival_rate = ('survived','mean')
)

        total_passengers    avg_age  survival_rate
sex
female               314  27.915709       0.742038
male                 577  30.726645       0.188908